tutorials/heatTransfer/hotRoom/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       11200;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       11600;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       12000;
    }
)

// ************************************************************************* //
