tutorials/heatTransfer/hotRoom/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        preconditioner  DILU;
        tolerance       1e-09;
        relTol          0.01;
        nPreSweeps      1;
        nPostSweeps     3;
        maxIter         20;
    }

    U
    {
        solver          smoothSolver;
        smoother        DILU;
        tolerance       1e-09;
        relTol          0.01;
        maxIter         20;
    }

    T
    {
        solver          smoothSolver;
        smoother        DILU;
        tolerance       1e-09;
        relTol          0.01;
        maxIter         20;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p               1e-2;
        U               1e-4;
        T               1e-2;
    }
}

relaxationFactors
{
    fields
    {
        p               0.7;
    }
    equations
    {
        U               0.3;
        T               0.5;
    }
}


// ************************************************************************* //
